content/posts/Innovu/contextual design interview template/index.org
+++
title = "Contextual Design Interview Template"
date  =   "2024-09-11"
+++

** Introduction
- Introductions 5m
- Elliott and Shane Combined Intro
- User Age
** This conversation will be recorded
- So we can focus on the conversation and not collection
- Will only be viewed by the internal innovu team
*** The Process
- Two parts, a conventional interview and a contextual inquiry
- The first part we’ll be collecting background information
- The second part, we’ll be watching you use the lens platform
- Our job is to understand how people actually use the platform
- and we need you to teach us how it’s actually used
- So we’re going to take a teacher-student approach
- By definition, whatever you do is the right way, we aren’t testing your lens skills 
- We’re going to interview 20-30 people to find patterns in use and optimize the app for those functions
- Background on you

** Conventional Interview 10m
*** Experience with Tech outside of work
- Most used apps
- favorite app
- Most used device

*** Experience with Technology at work
- Job Title
- Job Functions
- Places of work: remote, big screen, cube, phone, etc
- Most used apps
- Favorite app

*** Lens Intro
- History with innovu: when did you sign up, what was onboarding like
- How often do you use lens?
- What are the most common tasks in lens?
- What are the most important parts of lens?
- What’s something you can’t figure out how to do in lens?
- Last time you used lens?
- Do you have to do anything with Lens today?
- **What data like lasers, ins’t in Lens that would improve functionality**
- Who else uses innovu? and why?
- **What are the last 5 quick questions you wanted out of lens**


*** Transition
- Let’s transition to you showing us the lens app and how you use it
- Think of us like students, when you’re moving around, tell us what your thought process is while you’re doing it
- Start at the beginning, what prompted this task



** Contextual Inquiry 45m
- Is this the homepage you chose?
- Can you give us a quick tour of the app
- Look at calendar for day in the life
- Insert rando questions

** Wrap-Up
- biggest issue with the app  
- can you send me the files
