public/posts/innovu/contextual-design-interview-template/index.html
<!DOCTYPE html>
<html lang="en-US"><head><title>Contextual Design Interview Template - Hugo-Tufte Theme Example Site</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1, viewport-fit=cover">
<meta name="description"
    content="Introduction Introductions 5m Elliott and Shane Combined Intro User Age This conversation will be recorded So we can focus on the conversation and not collection Will only be viewed by the internal innovu team The Process Two parts, a conventional interview and a contextual inquiry The first part we’ll be collecting background information The second part, we’ll be watching you use the lens platform Our job is to understand how people actually use the platform and we need you to teach us how it’s actually used So we’re going to take a teacher-student approach By definition, whatever you do is the right way, we aren’t testing your lens skills We’re going to interview 20-30 people to find patterns in use and optimize the app for those functions Background on you Conventional Interview 10m Experience with Tech outside of work Most used apps favorite app Most used device Experience with Technology at work Job Title Job Functions Places of work: remote, big screen, cube, phone, etc Most used apps Favorite app Lens Intro History with innovu: when did you sign up, what was onboarding like How often do you use lens? ">
<link rel="canonical" href="http://localhost:1313/posts/innovu/contextual-design-interview-template/" />


<link rel="icon" href="http://localhost:1313/favicon.ico" />


<link rel="apple-touch-icon" href="http://localhost:1313/touch-icon.png" />

  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/modern-normalize/1.1.0/modern-normalize.min.css" crossorigin="anonymous" referrerpolicy="no-referrer" />










<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin />
<link rel="preload" as="style"
      href="https://fonts.googleapis.com/css?family=Noto+Serif+SC|Noto+Emoji&display=swap" />
<link rel="stylesheet"
      href="https://fonts.googleapis.com/css?family=Noto+Serif+SC|Noto+Emoji&display=swap"
      media="print" onload="this.media='all'" />
<noscript>
<link rel="stylesheet"
      href="https://fonts.googleapis.com/css?family=Noto+Serif+SC&display=swap" />
</noscript>






<link rel="stylesheet" href="http://localhost:1313/css/hugo-tufte.min.css">



<link rel="stylesheet" href="http://localhost:1313/css/hugo-tufte-options.min.css">

<link rel="stylesheet" href="http://localhost:1313/css/hugo-tufte-override.css">

</head>
<body>


<article id="main">
  <section>
<h1 class="content-title">Contextual Design Interview Template</h1></section>

  

  <section>
<div id="outline-container-headline-1" class="outline-3">
<h3 id="headline-1">
Introduction
</h3>
<div id="outline-text-headline-1" class="outline-text-3">
<ul>
<li>Introductions 5m</li>
<li>Elliott and Shane Combined Intro</li>
<li>User Age</li>
</ul>
</div>
</div>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
This conversation will be recorded
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<ul>
<li>So we can focus on the conversation and not collection</li>
<li>Will only be viewed by the internal innovu team</li>
</ul>
<div id="outline-container-headline-3" class="outline-4">
<h4 id="headline-3">
The Process
</h4>
<div id="outline-text-headline-3" class="outline-text-4">
<ul>
<li>Two parts, a conventional interview and a contextual inquiry</li>
<li>The first part we’ll be collecting background information</li>
<li>The second part, we’ll be watching you use the lens platform</li>
<li>Our job is to understand how people actually use the platform</li>
<li>and we need you to teach us how it’s actually used</li>
<li>So we’re going to take a teacher-student approach</li>
<li>By definition, whatever you do is the right way, we aren’t testing your lens skills </li>
<li>We’re going to interview 20-30 people to find patterns in use and optimize the app for those functions</li>
<li>Background on you</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Conventional Interview 10m
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<div id="outline-container-headline-5" class="outline-4">
<h4 id="headline-5">
Experience with Tech outside of work
</h4>
<div id="outline-text-headline-5" class="outline-text-4">
<ul>
<li>Most used apps</li>
<li>favorite app</li>
<li>Most used device</li>
</ul>
</div>
</div>
<div id="outline-container-headline-6" class="outline-4">
<h4 id="headline-6">
Experience with Technology at work
</h4>
<div id="outline-text-headline-6" class="outline-text-4">
<ul>
<li>Job Title</li>
<li>Job Functions</li>
<li>Places of work: remote, big screen, cube, phone, etc</li>
<li>Most used apps</li>
<li>Favorite app</li>
</ul>
</div>
</div>
<div id="outline-container-headline-7" class="outline-4">
<h4 id="headline-7">
Lens Intro
</h4>
<div id="outline-text-headline-7" class="outline-text-4">
<ul>
<li>History with innovu: when did you sign up, what was onboarding like</li>
<li>How often do you use lens?</li>
<li>What are the most common tasks in lens?</li>
<li>What are the most important parts of lens?</li>
<li>What’s something you can’t figure out how to do in lens?</li>
<li>Last time you used lens?</li>
<li>Do you have to do anything with Lens today?</li>
<li><strong><strong>What data like lasers, ins’t in Lens that would improve functionality</strong></strong></li>
<li>Who else uses innovu? and why?</li>
<li><strong><strong>What are the last 5 quick questions you wanted out of lens</strong></strong></li>
</ul>
</div>
</div>
<div id="outline-container-headline-8" class="outline-4">
<h4 id="headline-8">
Transition
</h4>
<div id="outline-text-headline-8" class="outline-text-4">
<ul>
<li>Let’s transition to you showing us the lens app and how you use it</li>
<li>Think of us like students, when you’re moving around, tell us what your thought process is while you’re doing it</li>
<li>Start at the beginning, what prompted this task</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-9" class="outline-3">
<h3 id="headline-9">
Contextual Inquiry 45m
</h3>
<div id="outline-text-headline-9" class="outline-text-3">
<ul>
<li>Is this the homepage you chose?</li>
<li>Can you give us a quick tour of the app</li>
<li>Look at calendar for day in the life</li>
<li>Insert rando questions</li>
</ul>
</div>
</div>
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
Wrap-Up
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<ul>
<li>biggest issue with the app  </li>
<li>can you send me the files</li>
</ul>
</div>
</div>
</section>
  <section><footer class="page-footer">
<hr />

<div class="previous-post" style="display:inline-block;">
  
  <a class="link-reverse" href="http://localhost:1313/posts/innovu/hmw/?ref=footer">« How Might We Statements</a>
  
</div>

<div class="next-post", style="display:inline-block;float:right;">
  
  <a class="link-reverse" href="http://localhost:1313/posts/innovu/breakdowns/?ref=footer">Breakdowns »</a>
  
</div>

<ul class="page-footer-menu">
  
  
  
  

  

  

  

  

  

  

  

  

  

  

  
  
  
</ul>





</footer>
</section>
  <section><nav class="menu">
    <ul>
    
        <li><a href="http://localhost:1313/">Home</a></li>
    
        <li><a href="http://localhost:1313/posts/">Posts</a></li>
    
        <li><a href="http://localhost:1313/a-book/">A-Book</a></li>
    
        <li><a href="http://localhost:1313/categories/">Categories</a></li>
    
        <li><a href="http://localhost:1313/about/">About</a></li>
    
        <li><a href="https://github.com/loikein/hugo-tufte">Source Code</a></li>
    
    </ul>
</nav>
</section>
</article>





</body>

</html>
